{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "Flatten", "config": {"trainable": true, "batch_input_shape": [null, 28, 28], "dtype": "float32", "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "units": 128, "name": "dense", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "units": 10, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "kernel_regularizer": null}}], "name": "sequential"}}